[Killed] BooleanLiteral
client/src/hooks/useToggle.ts:3:43
 import { useState } from "react"
 
-export default (initialToggled: boolean = false) => {
+export default (initialToggled: boolean = true) => {
   const [toggled, setToggled] = useState(initialToggled);
 
killedBy: Test useToggle should be initially false
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BlockStatement
client/src/hooks/useToggle.ts:8:19
 
   return {
     toggled,
-    toggle: () => {
-      setToggled(!toggled);
-    }
+    toggle: () => {}
   }
 }
killedBy: Test useToggle should toggle to true
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BooleanLiteral
client/src/hooks/useToggle.ts:9:18
   return {
     toggled,
     toggle: () => {
-      setToggled(!toggled);
+      setToggled(toggled);
     }
   }
killedBy: Test useToggle should toggle to true
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false
