[Killed] BlockStatement
src/utils/numbers/isEven.ts:2:38
 export default (number: number) => {
-  if (Math.round(number) !== number) {
-    return new Error();
-  }
+  if (Math.round(number) !== number) {}
 
   return number % 2 === 0;
killedBy: Test isEven should throw error if number is float
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [Error]
Received: false

[Killed] EqualityOperator
src/utils/numbers/isEven.ts:2:7
 export default (number: number) => {
-  if (Math.round(number) !== number) {
+  if (Math.round(number) === number) {
     return new Error();
   }
killedBy: Test isEven should return true for even number
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: [Error]

[Killed] ConditionalExpression
src/utils/numbers/isEven.ts:6:10
     return new Error();
   }
 
-  return number % 2 === 0;
+  return false;
 }
 
killedBy: Test isEven should return true for even number
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/numbers/isEven.ts:6:10
     return new Error();
   }
 
-  return number % 2 === 0;
+  return true;
 }
 
killedBy: Test isEven should return false for odd number
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true
